Ran Plan for dir: `newrelic` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ssm_parameter.email will be created
+ resource "aws_ssm_parameter" "email" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/global/newrelic/email"
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # aws_ssm_parameter.slack-channel will be created
+ resource "aws_ssm_parameter" "slack-channel" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/global/newrelic/slack-channel"
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # newrelic_alert_channel.email-channel will be created
+ resource "newrelic_alert_channel" "email-channel" {
      + id   = (known after apply)
      + name = "me"
      + type = "email"

      + config {
          + include_json_attachment = "0"
          + recipients              = "fakevalue"
        }
    }

  # newrelic_alert_channel.slack-channel will be created
+ resource "newrelic_alert_channel" "slack-channel" {
      + id   = (known after apply)
      + name = "Slack"
      + type = "slack"

      + config {
          + channel = "#fakechannel"
          + url     = (sensitive value)
        }
    }

  # newrelic_alert_policy_channel.send-web-checks-to-slack will be created
+ resource "newrelic_alert_policy_channel" "send-web-checks-to-slack" {
      + channel_ids = (known after apply)
      + id          = (known after apply)
      + policy_id   = 1205011
    }

  # newrelic_synthetics_alert_condition.bc will be created
+ resource "newrelic_synthetics_alert_condition" "bc" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "Plex Web Alert Policy"
      + policy_id  = 1205011
    }

  # newrelic_synthetics_alert_condition.cloud will be created
+ resource "newrelic_synthetics_alert_condition" "cloud" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "NextCloud Web Alert Policy"
      + policy_id  = 1205011
    }

  # newrelic_synthetics_alert_condition.plex will be created
+ resource "newrelic_synthetics_alert_condition" "plex" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "Plex Web Alert Policy"
      + policy_id  = 1205011
    }

  # newrelic_synthetics_alert_condition.qtosw will be created
+ resource "newrelic_synthetics_alert_condition" "qtosw" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "QTOSW Web Alert Policy"
      + policy_id  = 1205011
    }

  # newrelic_synthetics_alert_condition.rancher will be created
+ resource "newrelic_synthetics_alert_condition" "rancher" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "Rancher Web Alert Policy"
      + policy_id  = 1205011
    }

  # newrelic_synthetics_alert_condition.torrent will be created
+ resource "newrelic_synthetics_alert_condition" "torrent" {
      + enabled    = true
      + id         = (known after apply)
      + monitor_id = (known after apply)
      + name       = "Torrent Web Alert Policy"
      + policy_id  = 1205011
    }

  # newrelic_synthetics_monitor.bc will be created
+ resource "newrelic_synthetics_monitor" "bc" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "BC"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://bc.qtosw.com"
      + validation_string = "server is up"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.cloud will be created
+ resource "newrelic_synthetics_monitor" "cloud" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "NextCloud"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://cloud.qtosw.com"
      + validation_string = "Nextcloud"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.plex will be created
+ resource "newrelic_synthetics_monitor" "plex" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "Plex"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://plex.qtosw.com/web/index.html"
      + validation_string = "plex"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.qtosw will be created
+ resource "newrelic_synthetics_monitor" "qtosw" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "QTOSW"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://qtosw.com"
      + validation_string = "Witty"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.rancher will be created
+ resource "newrelic_synthetics_monitor" "rancher" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "Rancher"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://rancher.qtosw.com"
      + validation_string = "Loading"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.torrent will be created
+ resource "newrelic_synthetics_monitor" "torrent" {
      + frequency         = 10
      + id                = (known after apply)
      + locations         = [
          + "AWS_US_EAST_1",
        ]
      + name              = "Torrent"
      + sla_threshold     = 7
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://torrent.qtosw.com"
      + validation_string = "WebUI"
      + verify_ssl        = true
    }

Plan: 17 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d newrelic`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.qtosw.com/lock?id=tyzbit%252Fterraform%252Fnewrelic%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d newrelic`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
